neuroscience/index.org
#+title: Computational Neuroscience
#+author: Marco Craveiro
#+options: num:nil author:nil toc:nil
#+bind: org-html-validation-link nil
#+HTML_HEAD: <link rel="stylesheet" href="../css/tufte.css" type="text/css" />

[[file:../index.org][Back to home page]].

On my [[http://www.catb.org/~esr/jargon/html/C/copious-free-time.html][copious free time]], I like to learn a little bit about
[[https://en.wikipedia.org/wiki/Computational_neuroscience][computational neuroscience]]. At one point I even considered doing my
PhD in this field, before realising my lack of knowledge of biology,
chemistry, physics and mathematics was a bit of an
impediment. Nonetheless, I still like learning and writing about the
subject.

* Other people's material

My main a hero in this field, [[https://en.wikipedia.org/wiki/Jeff_Hawkins][Jeff Hawkins]] (he of Palm fame), and I
highly recommend both of his books, which target laypeople like me and
are at the "popular science" level.

- [[https://numenta.com/resources/on-intelligence/][On Intelligence]]
- [[https://numenta.com/a-thousand-brains-by-jeff-hawkins][A Thousand Brains: A New Theory of Intelligence]]

If you are interested in more "serious" academic material (but still
introductory), I also recommend:

- [[http://www.cambridge.org/us/academic/subjects/life-sciences/neuroscience/principles-computational-modelling-neuroscience][Principles of Computational Modelling in Neuroscience]]: "bible" of
  the subject for newcomers.
- [[https://lcnwww.epfl.ch/gerstner/NeuronalDynamics-MOOCall.html][Neuronal Dynamics - Computational Neuroscience]]: series of lectures
  by Gerstner.

* My material

All of the material I have written is at the interested layperson
level.

** Neurons for Computer Geeks

This is a series of blog posts that attempts to introduce all concepts
necessary to understand one of the the simplest models of a neuron:
LIF. The series never quite finished but it may still prove useful to
anyone trying to get a basic overview of what neurons are, and how one
would go about modeling them.

| Part | Title                                  | Date                          | Description                                              |
|------+----------------------------------------+-------------------------------+----------------------------------------------------------|
| I    | [[file:neurons_for_geeks_part_1.org][A Neuron From Up On High]]               | Monday, August 31, 2015       | General overview of the neuron cell.                     |
| II   | [[file:neurons_for_geeks_part_2.org][The Shocking Complexity of Electricity]] | Monday, August 31, 2015       | Overview of key electrical terms.                        |
| III  | [[file:neurons_for_geeks_part_3.org][Coding Interlude]]                       | Friday, September 04, 2015    | We start a project to contain the models.                |
| IV   | [[file:neurons_for_geeks_part_4.org][More Electricity]]                       | Saturday, September 05, 2015  | We resume our journey into core electrical concepts.     |
| V    | [[file:neurons_for_geeks_part_5.org][Yet More Theory]]                        | Monday, September 07, 2015    | We now discuss the mathematical modeling of neurons.     |
| VI   | [[file:neurons_for_geeks_part_6.org][LIF At Long Last!]]                      | Wednesday, September 16, 2015 | All the concepts are brought together in the LIF models. |
