neuroscience/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-10 Sat 17:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computational Neuroscience</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Computational Neuroscience</h1>
<p>
<a href="../index.html">Back to home page</a>.
</p>

<p>
On my <a href="http://www.catb.org/~esr/jargon/html/C/copious-free-time.html">copious free time</a>, I like to learn a little bit about
<a href="https://en.wikipedia.org/wiki/Computational_neuroscience">computational neuroscience</a>. At one point I even considered doing my
PhD in this field, before realising my lack of knowledge of biology,
chemistry, physics and mathematics was a bit of an
impediment. Nonetheless, I still like learning and writing about the
subject.
</p>

<div id="outline-container-orgbeb4f90" class="outline-2">
<h2 id="orgbeb4f90">Other people's material</h2>
<div class="outline-text-2" id="text-orgbeb4f90">
<p>
My main a hero in this field, <a href="https://en.wikipedia.org/wiki/Jeff_Hawkins">Jeff Hawkins</a> (he of Palm fame), and I
highly recommend both of his books, which target laypeople like me and
are at the "popular science" level.
</p>

<ul class="org-ul">
<li><a href="https://numenta.com/resources/on-intelligence/">On Intelligence</a></li>
<li><a href="https://numenta.com/a-thousand-brains-by-jeff-hawkins">A Thousand Brains: A New Theory of Intelligence</a></li>
</ul>

<p>
If you are interested in more "serious" academic material (but still
introductory), I also recommend:
</p>

<ul class="org-ul">
<li><a href="http://www.cambridge.org/us/academic/subjects/life-sciences/neuroscience/principles-computational-modelling-neuroscience">Principles of Computational Modelling in Neuroscience</a>: "bible" of
the subject for newcomers.</li>
<li><a href="https://lcnwww.epfl.ch/gerstner/NeuronalDynamics-MOOCall.html">Neuronal Dynamics - Computational Neuroscience</a>: series of lectures
by Gerstner.</li>
</ul>
</div>
</div>

<div id="outline-container-org67e1050" class="outline-2">
<h2 id="org67e1050">My material</h2>
<div class="outline-text-2" id="text-org67e1050">
<p>
All of the material I have written is at the interested layperson
level.
</p>
</div>

<div id="outline-container-orgb6516b4" class="outline-3">
<h3 id="orgb6516b4">Neurons for Computer Geeks</h3>
<div class="outline-text-3" id="text-orgb6516b4">
<p>
This is a series of blog posts that attempts to introduce all concepts
necessary to understand one of the the simplest models of a neuron:
LIF. The series never quite finished but it may still prove useful to
anyone trying to get a basic overview of what neurons are, and how one
would go about modeling them.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">I</td>
<td class="org-left"><a href="neurons_for_geeks_part_1.html">A Neuron From Up On High</a></td>
<td class="org-left">Monday, August 31, 2015</td>
<td class="org-left">General overview of the neuron cell.</td>
</tr>

<tr>
<td class="org-left">II</td>
<td class="org-left"><a href="neurons_for_geeks_part_2.html">The Shocking Complexity of Electricity</a></td>
<td class="org-left">Monday, August 31, 2015</td>
<td class="org-left">Overview of key electrical terms.</td>
</tr>

<tr>
<td class="org-left">III</td>
<td class="org-left"><a href="neurons_for_geeks_part_3.html">Coding Interlude</a></td>
<td class="org-left">Friday, September 04, 2015</td>
<td class="org-left">We start a project to contain the models.</td>
</tr>

<tr>
<td class="org-left">IV</td>
<td class="org-left"><a href="neurons_for_geeks_part_4.html">More Electricity</a></td>
<td class="org-left">Saturday, September 05, 2015</td>
<td class="org-left">We resume our journey into core electrical concepts.</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left"><a href="neurons_for_geeks_part_5.html">Yet More Theory</a></td>
<td class="org-left">Monday, September 07, 2015</td>
<td class="org-left">We now discuss the mathematical modeling of neurons.</td>
</tr>

<tr>
<td class="org-left">VI</td>
<td class="org-left"><a href="neurons_for_geeks_part_6.html">LIF At Long Last!</a></td>
<td class="org-left">Wednesday, September 16, 2015</td>
<td class="org-left">All the concepts are brought together in the LIF models.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-10 Sat 17:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
